# **Question 1**

In [1]:
import pandas as pd
print(pd.__version__)

1.1.4

# **Question 2**

In [2]:
import numpy as np
import pandas as pd
data1 = np.array(['A', 'B', 'C', 'D', 'E']) 
series1 = pd.Series(data1) 
print(series1)

0    A
1    B
2    C
3    D
4    E
dtype: object

# **Question 3**

In [4]:
import numpy as np
import pandas as pd
data1 = np.array(['A', 'B', 'C', 'D', 'E']) 
series1 = pd.Series(data1, index = [1, 2, 3, 4, 5]) 
df1 = series1.to_frame().reset_index() 
df1

   index  0
0      1  A
1      2  B
2      3  C
3      4  D
4      5  E

# **Question 4**

In [5]:
import seaborn as sns
mpg=sns.load_dataset('mpg')
print(mpg)

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

# **Question 5**

In [6]:
import seaborn as sns
import pandas as pd
mpg=sns.load_dataset('mpg')
df = pd.DataFrame(mpg)
df.origin.unique()

array(['usa', 'japan', 'europe'], dtype=object)

# **Question 6**

In [7]:
import seaborn as sns
import pandas as pd
mpg=sns.load_dataset('mpg')
df = pd.DataFrame(mpg)
df[df['origin'].str.contains("usa")]

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
392  27.0          4  ...     usa           chevrolet camaro
393  27.0          4  ...     usa            ford mustang gl
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[249 rows x 9 columns]